InformationRegisters/СтатусыЗаявокНаАренду_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаявокНаАренду_ат</Name>
			<Comment>!!!!!HOTFIX + переименовать</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтатусовЗаявокНаАренду_ат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаАрендуОборудования_ат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаАрендуПП_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ФормаСменыСтатусаЗаявкиНаАренду_ат/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьСтатусНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(Команда)
ТекущийСтатус = Аренда_ат.ПолучитьПоследнийСтатусЗаявки(Документ);
Если НЕ ТекущийСтатус = Статус тогда 
	ВопросНаСменуСтатуса = Вопрос("Документ уже имеет статус """ + ТекущийСтатус + """, Вы действиетельно хотите его поменять?",
		РежимДиалогаВопрос.ДаНет); 
	Если ВопросНаСменуСтатуса = КодВозвратаДиалога.Да тогда 
		СтатусЗаписать();
	КонецЕсли;
Иначе
	Сообщить("Статус не изменен!",СтатусСообщения.Внимание);
КонецЕсли;
//УстановитьСтатусНаСервере();
Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документ = Параметры.Документ;
	Статус   = Аренда_ат.ПолучитьПоследнийСтатусЗаявки(Документ);
	
КонецПроцедуры

&НаСервере
Процедура СтатусЗаписать()

	ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
	ЗаписьСтатуса.Отбор.Заявка.Установить(Документ);
		НаборЗаписей = ЗаписьСтатуса.Добавить();
		НаборЗаписей.Период = ТекущаяДата();
		НаборЗаписей.Заявка = Документ;
		НаборЗаписей.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		НаборЗаписей.Статус = Статус;
	ЗаписьСтатуса.Записать(ложь);
	//Закрыть();
	

КонецПроцедуры
